package ru.job4j;

public class Variables2 {
    public static void main(String[] args) {
        /*
        * byte age = 20; - возраст (подразумевается возраст человека);
        * char gender = 'M'; - пол (обозначать будем символами - мужской сокращаем до М, женский до Ж);
        * float height = 2.05F; - рост (измерять будем в метрах);
        * short numberOfBricks = 22000; - количество кирпичей для постройки дома (небольшой одноэтажный дом площадью 100м2);
        * double numberOfBacteria = 80.5; - количество бактерий (измерять будем в КОЕ / г - такую величину можно встретить
        если почитать состав обычного йогурта, часто там можно встретить число 1 * 107 КОЕ / г);
        * double distance = 152055052.76; - расстояние до космических объектов (измерять будем в км);
        * boolean permission = true; - разрешение на работу
        (рассматриваем всего 2 значения - или есть разрешение или его нет);
        * long size = 800000000000L; - размер файла (измерять будем в байтах).
         */
    }
}