package ru.job4j;

public class Variables2 {
    public static void main(String[] args) {
        /*
        * byte; - возраст (подразумевается возраст человека);
        * char; - пол (обозначать будем символами - мужской сокращаем до М, женский до Ж);
        * float; - рост (измерять будем в метрах);
        * short; - количество кирпичей для постройки дома (небольшой одноэтажный дом площадью 100м2);
        * int; - количество бактерий (измерять будем в КОЕ / г - такую величину можно встретить
        если почитать состав обычного йогурта, часто там можно встретить число 1 * 107 КОЕ / г);
        * long; - расстояние до космических объектов (измерять будем в км);
        * boolean; - разрешение на работу
        (рассматриваем всего 2 значения - или есть разрешение или его нет);
        * byte; - размер файла (измерять будем в байтах).
         */
    }
}